//! http://odz.sakura.ne.jp/projecteuler/index.php?cmd=read&page=Problem%20100
//!
//! 箱の中に15個の青い円盤と6個の赤い円盤からなる21個の色のついた円盤が入っていて, 無作為に2つ取り出すとき, 青い円盤2つを取り出す確率P(BB)は
//!
//! P(BB) = (15/21) × (14/20) = 1/2
//! であることがわかる.
//!
//! 無作為に2つ取り出すとき, 青い円盤2つを取り出す確率がちょうど1/2となるような円盤数が次に多い組み合わせは, 箱が85個の青い円盤と35個の赤い円盤からなるときである.
//!
//! 箱の中の円盤の合計が1012 = 1,000,000,000,000を超えるような最初の組み合わせを考える. 箱の中の青い円盤の数を求めよ.

// xを合計の円盤、yを青い円盤の枚数として式を立てると
// y(y-1) / x(x-1) = 1/2
// 式を整理すると
// (2x - 1)^2 -2(2y - 1)^2 = -1
// X := 2x - 1, Y := 2y - 1 と置くと
// X^2 - 2Y^2 = -1
// のペル方程式に帰着できる。
// x + y rt(n) = (x0 + y0 rt(n))^k の性質およびx0=1, y0=1から
// x + y rt(2) = (1 + rt(2))^k を得る。

fn main() {
    let find_blue = (1..)
        .scan((1, 1), |acc, _| {
            let x = acc.0 + 2 * acc.1;
            let y = acc.0 + acc.1;
            *acc = (x, y);
            Some((x, y))
        })
        .filter(|(x, y)| x % 2 == 1 && y % 2 == 1)
        .map(|(x, y)| (((x + 1) / 2), ((y + 1) / 2)))
        .find(|&(x, _)| x > 10_u128.pow(12));

    println!("{:?}", find_blue);
}
