//! http://odz.sakura.ne.jp/projecteuler/index.php?cmd=read&page=Problem%20145
//!
//! ある正の整数nについて, [n + reverse(n)]が奇数のみで表されるようなnが存在する. 例えば, 36 + 63 = 99, 409 + 904 = 1313 のように. この性質を持つ数を, reversibleと呼ぶことにする. つまり, 36, 63, 409, 904はrevesibleである. 先頭の0はnでもreverse(n)でも許されない.
//!
//! 1000未満には120個のreversibleな数が存在する.
//!
//! 10億(109)未満では, いくつのreversibleな数が存在するか.

// 分析後のメモ
// 偶数桁の場合 => 10 * 15^(n/2-1) * 2
// 4n+1桁の場合 => 0
// 4n+3桁の場合 => 少し複雑だけど一般化できそう

fn main() {
    let mut count = 0;

    // 2桁
    // 11 * (a + b)
    // a, bの偶奇が異なり、繰り上がりしない組み合わせ（0は除外）
    // 1: 2,4,6,8; 2: 3,5,7; 3: 4,6; 4: 5
    // => 10 * 2 = 20
    count += 20;

    // 3桁
    // 101 * (a + c) + 20 * b
    // a, cの偶奇が異なり、繰り上がりする組み合わせ（0は除外）かつ20 * bは繰り上がりしない。
    // 2: 9; 3: 8; 4: 7,9; 5: 6,8; 6: 7,9; 7: 8; 8: 9; b=0,1,2,3,4
    // => 10 * 5 * 2 = 100
    count += 100;

    // 4桁
    // 1001 * (a + d) + 110 * (b + c)
    // a, dの偶奇が異なり、繰り上がりしない組み合わせ（0は除外）かつb + cは奇数で繰り上がりしない組み合わせ
    // a,d=2桁と同じ; b,c=0: 1,3,5,7,9; 1: 2,4,6,8; 2: 3,5,7; 3: 4,6; 4: 5
    // => 10 * 15 * 4 = 600
    count += 600;

    // 5桁
    // 10001 * (a + e) + 1010 * (b + d) + 200 * c
    // 100の位が偶数なのでb + dは繰り上がりが必要。一方、繰り上がると1万の位が偶数になる。
    // => 5桁でreversibleな数字は存在しない

    // 6桁
    // 100001 * (a + f) + 10010 * (b + e) + 1100 * (c + d)
    // a, fの偶奇が異なり、繰り上がりしない組み合わせ（0は除外）かつc + dもb + eも奇数で繰り上がりしない組み合わせ
    // a,f=2桁と同じ; b,e&c,d=0: 1,3,5,7,9; 1: 2,4,6,8; 2: 3,5,7; 3: 4,6; 4: 5
    // => 10 * 15 * 15 * 8 = 18000
    count += 18000;

    // 7桁
    // 1000001 * (a + g) + 100010 * (b + f) + 10100 * (c + e) + 2000 * d
    // 1000の位が偶数なのでc + eは繰り上がりが必要。よってb + fは偶数かつ繰り上がりしない（c + eは奇数）。よってa + gも繰り上がりが必要。また2000 * dは繰り上がりしない。
    // a,g=3桁と同じ; b,f=0: 0,2,4,6,8; 1: 1,3,5,7; 2: 2,4,6: 3: 3,5; 4: 4 c,e=3桁と同じ; d=0,1,2,3,4
    // => 10 * 10 * 4 * 5 * (10 * 2 + 5) = 50000
    count += 50000;

    // 8桁
    // 10000001 * (a + h) + 1000010 * (b + g) + 110000 * (c + f) 1100 * (d + e)
    // => 10 * 15 * 15 * 15 * 16 = 540000
    count += 540000;

    // 9桁
    // 100000001 * (a + i) + 10000010 * (b + h) + 1000100 * (c + g) + 101000 * (d + f)+ 20000 * e
    // 10000の位が偶数なのでd + fは繰り上がりが必要。よってc + gは偶数。よってb + hは繰り上がりが必要。一方、繰り上がると1億の位が偶数になる。
    // => 9桁でreversibleな数字は存在しない

    println!("{}", count);
}
